RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_spi_regs.h
/*
 * CS_O (RW)
 *
 * Output value for the SPI CS (chip select) signal
 */
#define SPI_DIRECTIO_CS_O_MASK (0x100U)
#define SPI_DIRECTIO_CS_O_SHIFT (8U)
#define SPI_DIRECTIO_CS_O_SET(x) (((uint32_t)(x) << SPI_DIRECTIO_CS_O_SHIFT) & SPI_DIRECTIO_CS_O_MASK)
#define SPI_DIRECTIO_CS_O_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_CS_O_MASK) >> SPI_DIRECTIO_CS_O_SHIFT)

/*
 * HOLD_I (RO)
 *
 * Status of the SPI Flash hold signal
 */
#define SPI_DIRECTIO_HOLD_I_MASK (0x20U)
#define SPI_DIRECTIO_HOLD_I_SHIFT (5U)
#define SPI_DIRECTIO_HOLD_I_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_HOLD_I_MASK) >> SPI_DIRECTIO_HOLD_I_SHIFT)

/*
 * WP_I (RO)
 *
 * Status of the SPI Flash write protect signal
 */
#define SPI_DIRECTIO_WP_I_MASK (0x10U)
#define SPI_DIRECTIO_WP_I_SHIFT (4U)
#define SPI_DIRECTIO_WP_I_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_WP_I_MASK) >> SPI_DIRECTIO_WP_I_SHIFT)

/*
 * MISO_I (RO)
 *
 * Status of the SPI MISO signal
 */
#define SPI_DIRECTIO_MISO_I_MASK (0x8U)
#define SPI_DIRECTIO_MISO_I_SHIFT (3U)
#define SPI_DIRECTIO_MISO_I_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_MISO_I_MASK) >> SPI_DIRECTIO_MISO_I_SHIFT)

/*
 * MOSI_I (RO)
 *
 * Status of the SPI MOSI signal
 */
#define SPI_DIRECTIO_MOSI_I_MASK (0x4U)
#define SPI_DIRECTIO_MOSI_I_SHIFT (2U)
#define SPI_DIRECTIO_MOSI_I_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_MOSI_I_MASK) >> SPI_DIRECTIO_MOSI_I_SHIFT)

/*
 * SCLK_I (RO)
 *
 * Status of the SPI SCLK signal
 */
#define SPI_DIRECTIO_SCLK_I_MASK (0x2U)
#define SPI_DIRECTIO_SCLK_I_SHIFT (1U)
#define SPI_DIRECTIO_SCLK_I_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_SCLK_I_MASK) >> SPI_DIRECTIO_SCLK_I_SHIFT)

/*
 * CS_I (RO)
 *
 * Status of the SPI CS (chip select) signal
 */
#define SPI_DIRECTIO_CS_I_MASK (0x1U)
#define SPI_DIRECTIO_CS_I_SHIFT (0U)
#define SPI_DIRECTIO_CS_I_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_CS_I_MASK) >> SPI_DIRECTIO_CS_I_SHIFT)

/* Bitfield definition for register: TRANSCTRL */
/*
 * SLVDATAONLY (RW)
 *
 * Data-only mode (slave mode only)
 * 0x0: Disable the data-only mode
 * 0x1: Enable the data-only mode
 * Note: This mode only works in the uni-directional regular (single) mode so MOSIBiDir, DualQuad and TransMode should be set to 0.
 */
#define SPI_TRANSCTRL_SLVDATAONLY_MASK (0x80000000UL)
#define SPI_TRANSCTRL_SLVDATAONLY_SHIFT (31U)
#define SPI_TRANSCTRL_SLVDATAONLY_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_SLVDATAONLY_SHIFT) & SPI_TRANSCTRL_SLVDATAONLY_MASK)
#define SPI_TRANSCTRL_SLVDATAONLY_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_SLVDATAONLY_MASK) >> SPI_TRANSCTRL_SLVDATAONLY_SHIFT)

/*
 * CMDEN (RW)
 *
 * SPI command phase enable (Master mode only)
 * 0x0: Disable the command phase
 * 0x1: Enable the command phase
 */
#define SPI_TRANSCTRL_CMDEN_MASK (0x40000000UL)
#define SPI_TRANSCTRL_CMDEN_SHIFT (30U)
#define SPI_TRANSCTRL_CMDEN_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_CMDEN_SHIFT) & SPI_TRANSCTRL_CMDEN_MASK)
#define SPI_TRANSCTRL_CMDEN_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_CMDEN_MASK) >> SPI_TRANSCTRL_CMDEN_SHIFT)

/*
 * ADDREN (RW)
 *
 * SPI address phase enable (Master mode only)
 * 0x0: Disable the address phase
 * 0x1: Enable the address phase
 */
#define SPI_TRANSCTRL_ADDREN_MASK (0x20000000UL)
#define SPI_TRANSCTRL_ADDREN_SHIFT (29U)
#define SPI_TRANSCTRL_ADDREN_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_ADDREN_SHIFT) & SPI_TRANSCTRL_ADDREN_MASK)
#define SPI_TRANSCTRL_ADDREN_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_ADDREN_MASK) >> SPI_TRANSCTRL_ADDREN_SHIFT)

/*
 * ADDRFMT (RW)
 *
 * SPI address phase format (Master mode only)
 * 0x0: Address phase is the regular (single) mode
 * 0x1: The format of the address phase is the same as the data phase (DualQuad).
 */
#define SPI_TRANSCTRL_ADDRFMT_MASK (0x10000000UL)
#define SPI_TRANSCTRL_ADDRFMT_SHIFT (28U)
#define SPI_TRANSCTRL_ADDRFMT_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_ADDRFMT_SHIFT) & SPI_TRANSCTRL_ADDRFMT_MASK)
#define SPI_TRANSCTRL_ADDRFMT_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_ADDRFMT_MASK) >> SPI_TRANSCTRL_ADDRFMT_SHIFT)

/*
 * TRANSMODE (RW)
 *
 * Transfer mode
 * The transfer sequence could be
 * 0x0: Write and read at the same time
 * 0x1: Write only
 * 0x2: Read only
 * 0x3: Write, Read
 * 0x4: Read, Write
 * 0x5: Write, Dummy, Read
 * 0x6: Read, Dummy, Write
 * 0x7: None Data (must enable CmdEn or AddrEn in master mode)
 * 0x8: Dummy, Write
 * 0x9: Dummy, Read
 * 0xa~0xf: Reserved
 */
#define SPI_TRANSCTRL_TRANSMODE_MASK (0xF000000UL)
#define SPI_TRANSCTRL_TRANSMODE_SHIFT (24U)
#define SPI_TRANSCTRL_TRANSMODE_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_TRANSMODE_SHIFT) & SPI_TRANSCTRL_TRANSMODE_MASK)
#define SPI_TRANSCTRL_TRANSMODE_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_TRANSMODE_MASK) >> SPI_TRANSCTRL_TRANSMODE_SHIFT)

/*
 * DUALQUAD (RW)
 *
 * SPI data phase format
 * 0x0: Regular (Single) mode
 * 0x1: Dual I/O mode
 * 0x2: Quad I/O mode
 * 0x3: Reserved
 */
#define SPI_TRANSCTRL_DUALQUAD_MASK (0xC00000UL)
#define SPI_TRANSCTRL_DUALQUAD_SHIFT (22U)
#define SPI_TRANSCTRL_DUALQUAD_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_DUALQUAD_SHIFT) & SPI_TRANSCTRL_DUALQUAD_MASK)
#define SPI_TRANSCTRL_DUALQUAD_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_DUALQUAD_MASK) >> SPI_TRANSCTRL_DUALQUAD_SHIFT)

/*
 * TOKENEN (RW)
 *
 * Token transfer enable (Master mode only)
 * Append a one-byte special token following the address phase for SPI read transfers. The value of the special token should be selected in TokenValue.
 * 0x0: Disable the one-byte special token
 * 0x1: Enable the one-byte special token
 */
#define SPI_TRANSCTRL_TOKENEN_MASK (0x200000UL)
#define SPI_TRANSCTRL_TOKENEN_SHIFT (21U)
#define SPI_TRANSCTRL_TOKENEN_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_TOKENEN_SHIFT) & SPI_TRANSCTRL_TOKENEN_MASK)
#define SPI_TRANSCTRL_TOKENEN_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_TOKENEN_MASK) >> SPI_TRANSCTRL_TOKENEN_SHIFT)

/*
 * WRTRANCNT (RW)
 *
 * Transfer count for write data
 * WrTranCnt indicates the number of units of data to be transmitted to the SPI bus from the Data Register. The actual transfer count is (WrTranCnt+1).
 * WrTranCnt only takes effect when TransMode is 0, 1, 3, 4, 5, 6 or 8.
 * The size (bit-width) of a data unit is defined by the DataLen field of the Transfer Format Register.
 * For TransMode 0, WrTranCnt must be equal to RdTranCnt.
 */
#define SPI_TRANSCTRL_WRTRANCNT_MASK (0x1FF000UL)
#define SPI_TRANSCTRL_WRTRANCNT_SHIFT (12U)
#define SPI_TRANSCTRL_WRTRANCNT_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_WRTRANCNT_SHIFT) & SPI_TRANSCTRL_WRTRANCNT_MASK)
#define SPI_TRANSCTRL_WRTRANCNT_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_WRTRANCNT_MASK) >> SPI_TRANSCTRL_WRTRANCNT_SHIFT)

